{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"dtype": "float32", "batch_input_shape": [null, 300, 300, 3], "sparse": false, "name": "image_input"}, "inbound_nodes": []}, {"class_name": "Model", "name": "vgg16", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"trainable": true, "strides": [2, 2], "name": "block1_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"trainable": true, "strides": [2, 2], "name": "block2_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block3_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"trainable": true, "strides": [2, 2], "name": "block3_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block4_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"trainable": true, "strides": [2, 2], "name": "block4_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "block5_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"trainable": true, "strides": [2, 2], "name": "block5_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "name": "vgg16", "output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["vgg16", 1, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "fc2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "name": "predictions", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["image_input", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.0.4"}